src/cf/Documents/GDS_АктЗавозаВывозаТехВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_АктЗавозаВывозаТехВоды</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плечо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месторождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_Месторождения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куст</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_Кусты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скважина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GDS_Скважины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Звеньевой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокГСМНаНачало</Name>
					<Comment>литров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходГСМ</Name>
					<Comment>литров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходГСМНорма</Name>
					<Comment>литров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходГСМФакт</Name>
					<Comment>литров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокГСМНаКонец</Name>
					<Comment>литров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолТехВоды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПутевыеЛисти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолТехВоды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕздок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/GDS_АктЗавозаВывозаТехВоды/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.GDS_АктЗавозаВывозаТехВоды";
	КомандаПечати.Идентификатор = "АктЗавозаВывозаТехВоды";
	КомандаПечати.Представление = НСтр("en='Report';ru='Акт завоза/вывоза тех воды'");

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если НЕ уатОбщегоНазначенияСервер.РазрешениеПечатиНепроведенногоДокумента(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктЗавозаВывозаТехВоды") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктЗавозаВывозаТехВоды",
			"Акт завоза/вывоза тех воды", ПечатьАктЗавозаВывозаТехВоды(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм);
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьАктЗавозаВывозаТехВоды(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктЗавозаВывозаТехВоды";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Макет = ПолучитьМакет("АктЗавозаВывозаТехВоды");
	
	ВставлятьРазделительСтраниц = Ложь;
	Для каждого ОбъектПечати из МассивОбъектов Цикл

		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ВставлятьРазделительСтраниц = Истина;
		
		Для Счетчик = 1 По 2 Цикл
			ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
			ОбластьШапка.Параметры.Контрагент = ОбъектПечати.Контрагент.Наименование;
			ОбластьШапка.Параметры.Организация = ОбъектПечати.Организация.Наименование;
			ОбластьШапка.Параметры.День = Формат(ОбъектПечати.Дата, "ДФ=dd");
			ОбластьШапка.Параметры.Месяц = Формат(ОбъектПечати.Дата, "ДФ=ММММ");
			ОбластьШапка.Параметры.Год = Формат(ОбъектПечати.Дата, "ДФ='yyyy""г.""'");
			ОбластьШапка.Параметры.Месторождение = ОбъектПечати.Месторождение;
			ОбластьШапка.Параметры.Куст = ОбъектПечати.Куст;
			ОбластьШапка.Параметры.Скважина = ОбъектПечати.Скважина;
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ОбластьШапкаОперации = Макет.ПолучитьОбласть("ШапкаОперации");
			ТабличныйДокумент.Вывести(ОбластьШапкаОперации);
			
			Для Каждого Строка Из ОбъектПечати.Операции Цикл
				ОбластьСтрокаОперации = Макет.ПолучитьОбласть("СтрокаОперации");
				ОбластьСтрокаОперации.Параметры.Операция = Строка.Наименование;
				ОбластьСтрокаОперации.Параметры.КолТехВоды = Строка.КолТехВоды;
				ТабличныйДокумент.Вывести(ОбластьСтрокаОперации);
			КонецЦикла;
			
			ОбластьИтогоОперации = Макет.ПолучитьОбласть("ИтогоОперации");
			ОбластьИтогоОперации.Параметры.ИтогоКолТехВоды = ОбъектПечати.Операции.Итог("КолТехВоды");
			ТабличныйДокумент.Вывести(ОбластьИтогоОперации);
			
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.Организация = ОбъектПечати.Организация;
			ОбластьПодвал.Параметры.Контрагент = ОбъектПечати.Контрагент;
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		КонецЦикла;
	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		ОбластьПутевыеЛисти = Макет.ПолучитьОбласть("ШапкаПутевыеЛисти");
		ТабличныйДокумент.Вывести(ОбластьПутевыеЛисти);

		Для каждого Строка Из ОбъектПечати.ПутевыеЛисти Цикл
			ОбластьСтрокаПутевыеЛисти = Макет.ПолучитьОбласть("СтрокаПутевыеЛисти");
			ОбластьСтрокаПутевыеЛисти.Параметры.ГосНом = Строка.ТС.ГосударственныйНомер;
			ОбластьСтрокаПутевыеЛисти.Параметры.ФИОВодителя = Строка.Водитель.Наименование;
			ОбластьСтрокаПутевыеЛисти.Параметры.КолТехВоды = Строка.КолТехВоды;
			ОбластьСтрокаПутевыеЛисти.Параметры.Ездок = Строка.КоличествоЕздок;
			ТабличныйДокумент.Вывести(ОбластьСтрокаПутевыеЛисти);
		КонецЦикла;
		
		ОбластьИтогоПутевыеЛисти = Макет.ПолучитьОбласть("ИтогоПутевыеЛисти");
		ОбластьИтогоПутевыеЛисти.Параметры.ИтогоКолТехВоды = ОбъектПечати.ПутевыеЛисти.Итог("КолТехВоды");
		ОбластьИтогоПутевыеЛисти.Параметры.ИтогоЕздок = ОбъектПечати.ПутевыеЛисти.Итог("КоличествоЕздок");
		ТабличныйДокумент.Вывести(ОбластьИтогоПутевыеЛисти);
		
		ОбластьПодвалОборотнаяСторона = Макет.ПолучитьОбласть("ПодвалОборотнаяСторона");
		ТабличныйДокумент.Вывести(ОбластьПодвалОборотнаяСторона);
		
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
